In [1]:
%load_ext sql
%sql postgresql://emilianodesu:password123@localhost:5432/ejercicio6

- Carlos Emiliano Mendoza Hernández
- Imanol Mendoza Sáenz de Buruaga

### Modelo Entidad-Relación

![MER](img/mer_e6.jpg "Modelo Entidad-Relacion")

### Modelo físico

In [3]:
%%sql
CREATE TABLE IF NOT EXISTS asesor (
    id_Asesor VARCHAR(10) NOT NULL,
    nombre_Asesor VARCHAR(50) NOT NULL,
    CONSTRAINT pk_asesor PRIMARY KEY (id_Asesor)
)

 * postgresql://emilianodesu:***@localhost:5432/ejercicio6
Done.

[]

In [4]:
%%sql
CREATE TABLE IF NOT EXISTS alumno (
    id_Alumno SERIAL,
    nombre_Alumno VARCHAR(50) NOT NULL,
    id_Asesor VARCHAR(10),
    CONSTRAINT pk_alumno PRIMARY KEY (id_Alumno),
    CONSTRAINT fk_asesor FOREIGN KEY (id_Asesor) REFERENCES asesor(id_Asesor) ON DELETE SET NULL ON UPDATE CASCADE
)

 * postgresql://emilianodesu:***@localhost:5432/ejercicio6
Done.

[]

### Inserción de datos

In [5]:
%%sql
INSERT INTO asesor (id_Asesor, nombre_Asesor) VALUES 
('as-1', 'Jorge Campos'), 
('as-2','Laura Sandoval'), 
('as-3','Adolfo Millan'),
('as-4','Fernando Arreola');

INSERT INTO alumno (nombre_Alumno, id_Asesor) VALUES
('Mauricio Barrientos', 'as-1'),
('Mauro Tabura', 'as-2'),
('Luz Rueda', 'as-1'),
('Jorge Santillan', NULL),
('Gabriela Gaytan', 'as-3');

 * postgresql://emilianodesu:***@localhost:5432/ejercicio6
4 rows affected.
5 rows affected.

[]

In [6]:
%%sql
SELECT * FROM alumno;

 * postgresql://emilianodesu:***@localhost:5432/ejercicio6
5 rows affected.

[(1, 'Mauricio Barrientos', 'as-1'),
 (2, 'Mauro Tabura', 'as-2'),
 (3, 'Luz Rueda', 'as-1'),
 (4, 'Jorge Santillan', None),
 (5, 'Gabriela Gaytan', 'as-3')]

In [7]:
%%sql
SELECT * FROM asesor;

 * postgresql://emilianodesu:***@localhost:5432/ejercicio6
4 rows affected.

[('as-1', 'Jorge Campos'),
 ('as-2', 'Laura Sandoval'),
 ('as-3', 'Adolfo Millan'),
 ('as-4', 'Fernando Arreola')]

### Consultas

Se desea conocer aquellos alumnos que ya 
cuentan con asesor. Interesa el nombre del asesor 
y del alumno.

In [54]:
%%sql
SELECT asesor.nombre_Asesor, alumno.nombre_Alumno FROM alumno
JOIN asesor ON alumno.id_Asesor = asesor.id_Asesor;

 * postgresql://emilianodesu:***@localhost:5432/ejercicio6
4 rows affected.

[('Jorge Campos', 'Mauricio Barrientos'),
 ('Laura Sandoval', 'Mauro Tabura'),
 ('Jorge Campos', 'Luz Rueda'),
 ('Adolfo Millan', 'Gabriela Gaytan')]

Se desea conocer aquellos alumnos que ya 
cuentan con asesor y aquellos que no. Interesa el 
nombre del asesor y del alumno.

In [55]:
%%sql
SELECT asesor.nombre_Asesor, alumno.nombre_Alumno FROM alumno
LEFT JOIN asesor ON alumno.id_Asesor = asesor.id_Asesor;

 * postgresql://emilianodesu:***@localhost:5432/ejercicio6
5 rows affected.

[('Jorge Campos', 'Mauricio Barrientos'),
 ('Laura Sandoval', 'Mauro Tabura'),
 ('Jorge Campos', 'Luz Rueda'),
 (None, 'Jorge Santillan'),
 ('Adolfo Millan', 'Gabriela Gaytan')]

Se desea conocer aquellos asesores que ya 
cuentan con tesista y aquellos que no. Interesa el 
nombre del asesor y del alumno.

In [56]:
%%sql
SELECT asesor.nombre_Asesor, alumno.nombre_Alumno FROM alumno
RIGHT JOIN asesor ON alumno.id_Asesor = asesor.id_Asesor;

 * postgresql://emilianodesu:***@localhost:5432/ejercicio6
5 rows affected.

[('Jorge Campos', 'Mauricio Barrientos'),
 ('Laura Sandoval', 'Mauro Tabura'),
 ('Jorge Campos', 'Luz Rueda'),
 ('Adolfo Millan', 'Gabriela Gaytan'),
 ('Fernando Arreola', None)]

Se desea conocer aquellos alumnos que ya 
cuentan con asesor, así como los alumnos sin 
asesor y los asesores sin alumnos. Interesa el 
nombre del asesor y del alumno.

In [57]:
%%sql
SELECT asesor.nombre_Asesor, alumno.nombre_Alumno FROM alumno
FULL OUTER JOIN asesor ON alumno.id_Asesor = asesor.id_Asesor;

 * postgresql://emilianodesu:***@localhost:5432/ejercicio6
6 rows affected.

[('Jorge Campos', 'Mauricio Barrientos'),
 ('Laura Sandoval', 'Mauro Tabura'),
 ('Jorge Campos', 'Luz Rueda'),
 (None, 'Jorge Santillan'),
 ('Adolfo Millan', 'Gabriela Gaytan'),
 ('Fernando Arreola', None)]

Se desea conocer aquellos alumnos sin asesor y 
los asesores sin alumnos. Interesa el nombre del 
asesor y del alumno.

In [58]:
%%sql
SELECT asesor.nombre_Asesor, alumno.nombre_Alumno FROM alumno
FULL OUTER JOIN asesor ON alumno.id_Asesor = asesor.id_Asesor
WHERE alumno.id_Asesor IS NULL OR asesor.id_Asesor IS NULL;

 * postgresql://emilianodesu:***@localhost:5432/ejercicio6
2 rows affected.

[(None, 'Jorge Santillan'), ('Fernando Arreola', None)]

Se desea conocer aquellos alumnos sin asesor. 
Interesa el nombre del alumno. Emplear joins.

In [59]:
%%sql
SELECT alumno.nombre_Alumno FROM alumno
LEFT JOIN asesor ON alumno.id_Asesor =asesor.id_Asesor
WHERE asesor.id_Asesor IS NULL;

 * postgresql://emilianodesu:***@localhost:5432/ejercicio6
1 rows affected.

[('Jorge Santillan',)]

Se desea conocer aquellos asesores sin 
alumnos. Interesa el nombre del asesor. Emplear 
joins.

In [60]:
%%sql
SELECT asesor.nombre_Asesor FROM alumno
RIGHT JOIN asesor ON alumno.id_Asesor =asesor.id_Asesor
WHERE alumno.id_Asesor IS NULL;

 * postgresql://emilianodesu:***@localhost:5432/ejercicio6
1 rows affected.

[('Fernando Arreola',)]